### pandas 入门

>pandas 是基于 NumPy 数组构建的，特别是基于数组的函数和不使 用 for 循环的数据处理。

In [1]:
import pandas as pd

### Series
>Series 是一种类似于一维数组的对象，它由一组数据(各种 NumPy 数据类型) 以及一组与之相关的数据标签(即索引)组成。

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj #从结果看更像是一种带索引值的列表

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2['d'] = 6

In [12]:
obj2 # ['d', 'b', 'a', 'c']在这里就是索引列表，其对应的又是0，1，2，3

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2 > 0] #这是python语言灵活性的一种体现，也就是相当于[item for item in obj2 if item > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2 #同理

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

>我们还可以将series看作是一个定长的有序字典

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

#### 如何将字典转化为series

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000,
'Utah': 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

>如果只传入一个字典，则结果 Series 中的索引就是原字典的键(有序排列)。

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [23]:
obj4 = pd.Series(sdata, index=states)

In [24]:
obj4 
#这里就像是先创建一个新的字典obj4，或者obj4继承obj3，
#然后测试新字典索引是否在旧字典中存在
#如果存在，那么就将旧字典中的所对应的索引的值赋给新的字典
#如果不存在那么久用NaN来代替 Nan - not a number

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

>我将使用缺失(missing)或 NA 表示缺失数据。pandas 的 isnull 和 notnull 函数可用于检测缺失数据

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4.isnull(),obj4.notnull() # 实例化方法，也就是类方法，obj4是一个对象

(California     True
 Ohio          False
 Oregon        False
 Texas         False
 dtype: bool, California    False
 Ohio           True
 Oregon         True
 Texas          True
 dtype: bool)

>Series 最重要的一个功能是，它会根据运算的索引标签自动对齐数据

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

>Series 对象本身及其索引都有一个 name 属性，该属性跟 pandas 其他的关键功 能关系非常密切

In [32]:
obj4.name = 'population'

In [33]:
obj4.index.name = 'state'

In [34]:
obj4 
# 这里我们可以将state看做列名，操作state也就是其对应的索引
# population 也就是一张表对应的表名称

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [37]:
obj #数据主要有两种形式，有序和无序，例如列表数据是有序的，而字典是无序的

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

>DataFrame 是一个表格型的数据结构，它含有一组有序的列，每列可以是不同 的值类型(数值、字符串、布尔值等)。DataFrame 既有行索引也有列索引， 它可以被看做由 Series 组成的字典(共用同一个索引)。DataFrame 中的数据 是以一个或多个二维块存放的(而不是列表、字典或别的一维数据结构)。有 关 DataFrame 内部的技术细节远远超出了本书所讨论的范围。
#综合来看也就是series是向量，而dataframe是矩阵

In [38]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada','Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],
                      index=['one','two','three','four','five','six'])
frame2 #从而自然而然的我们就可以想到缺省值的情况 比如缺少了debt

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
frame2['state'] # 字典键值对方式

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [46]:
frame2.year # 获取对象属性的方式

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [47]:
frame2.loc['three'] # 获取行数据 这里就像是数据库里的where

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2['debt'] = 16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [50]:
frame2['debt'] = np.arange(6.)

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [52]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four',
'five'])

In [53]:
frame2['debt'] = val

In [54]:
frame2 #对debt列进行替换，如果列向量和输入向量的个数不对应，则根据index进行填充

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [59]:
val_new = pd.Series([-1.2, -1.5, -1.7])
val_new

0   -1.2
1   -1.5
2   -1.7
dtype: float64

In [60]:
frame2['debt'] = val_new
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [62]:
val_new = pd.Series([-1.2, -1.5, -1.7],index=[1,2,3])
val_new

1   -1.2
2   -1.5
3   -1.7
dtype: float64

In [63]:
frame2['debt'] = val_new

In [64]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [71]:
frame2['eastern'] = frame2.state == 'Ohio'
#这样其实就是利用了==的优先级比=高，也就是bool运算优先级更高

In [72]:
frame2 #我们不能同frame2.estern来创建新的列

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7   NaN     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [73]:
del frame2['eastern']

In [74]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [75]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

>注意:通过索引方式返回的列只是相应数据的视图而已，并不是副本。因此,
对返回的 Series 所做的任何就地修改全都会反映到源 DataFrame 上。
通过 Series 的 copy 方法即可指定复制列。
对于视图的修改其实就是对原内存值的修改

#### 嵌套字典

In [84]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [85]:
frame3 = pd.DataFrame(pop)

In [86]:
frame3 
# 如果嵌套字典传给 DataFrame，pandas 就会被解释为:
#外层字典的键作为列， 内层键则作为行索引:

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [87]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [89]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

In [90]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [91]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [92]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [93]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

### 索引对象

In [94]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [95]:
index = obj.index

In [96]:
index

Index(['a', 'b', 'c'], dtype='object')

In [97]:
index[1:]

Index(['b', 'c'], dtype='object')

In [98]:
index[1] = 'd' # Index 对象是不可变的，因此用户不能对其进行修改:

TypeError: Index does not support mutable operations

In [99]:
labels = pd.Index(np.arange(3))

In [100]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [101]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [102]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [104]:
obj2.index is labels

True

In [105]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [106]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [107]:
'Ohio' in frame3.columns

True

In [108]:
2003 in frame3.index

False

In [110]:
2001 in frame3.index

True

In [111]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar']) # index元素可以是重复的元素

In [112]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### 基本功能

In [113]:
#重新索引
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a',
'c'])

In [114]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [115]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [116]:
obj2 #所以pd库里面很少会出现out of range这种error，如果真的缺少了值，那么直接缺省值上

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [117]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2,
4])

In [118]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [119]:
obj3.reindex(range(6), method='ffill') # 从结果看我们也可以对ffill方法的作用一探究竟

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [122]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas','California'])

In [123]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [124]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [125]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [126]:
states = ['Texas', 'Utah', 'California']

In [127]:
frame.reindex(columns=states)
# 从结果看，刚像是sql里面的right union,也就是后来者有更大的优先级

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

#### 丢弃指定轴上的项

In [128]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd',
'e'])

In [129]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [130]:
new_obj = obj.drop('c')

In [131]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [133]:
obj.drop(['b','c']) # 所以返回值为删除了指定轴后的frame对象

a    0.0
d    3.0
e    4.0
dtype: float64

In [134]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [135]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [136]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [138]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [139]:
obj.drop('c', inplace=True) 
# 这行命令就是不弹出新的obj，因为他是对原本数据对象的直接操作而不会创造一个新的对象出来

In [140]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

#### 索引、选取和过滤

In [141]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [142]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [143]:
obj['b']

1.0

In [144]:
obj[1] #obj['b']和obj[1]的效果是一样

1.0

In [145]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [146]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [147]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [148]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [149]:
obj['b':'c']
# 利用标签的切片运算与普通的 Python 切片运算不同，其末端是包含的:

b    1.0
c    2.0
dtype: float64

In [150]:
obj['b':'c'] = 5

In [151]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [152]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [153]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [155]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [156]:
data[:2] # 这是对行进行的操作

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [157]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [158]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [159]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### 用 loc 和 iloc 进行选取

In [160]:
data.loc['Colorado', ['two', 'three']] # 轴标签(loc)或整数索引(iloc)

two      5
three    6
Name: Colorado, dtype: int64

In [161]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [162]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [163]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [164]:
data.iloc[:, :3][data.three > 5] #这里的索引值和前面的表现不同，这里的3取不到

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [165]:
# 整数索引
ser = pd.Series(np.arange(3.))

In [166]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [168]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [169]:
ser2[-1] # 对于非整数索引，我们可以用包含0 1 2的索引值

2.0

In [170]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [171]:
ser[:1] # 这里没有包含1

0    0.0
dtype: float64

In [172]:
ser.loc[:1] # 这里就包含了1

0    0.0
1    1.0
dtype: float64

In [173]:
ser.iloc[:1] # 这里不包含1，所以只有loc包含第二个索引

0    0.0
dtype: float64

#### 算术运算和数据对齐

In [174]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd',
'e'])

In [175]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [176]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [177]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [178]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [179]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                   columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

In [180]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [181]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                   columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [182]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [183]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [184]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [185]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [186]:
df1 = pd.DataFrame({'A': [1, 2]})

In [187]:
df2 = pd.DataFrame({'B': [3, 4]})

In [188]:
df1

   A
0  1
1  2

In [189]:
df2

   B
0  3
1  4

In [190]:
df1 - df2 # 如果 DataFrame 对象相加，没有共用的列或行标签，结果都会是空:

    A   B
0 NaN NaN
1 NaN NaN

In [191]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))

In [195]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [196]:
df2.loc[1, 'b'] = np.nan

In [193]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [197]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [198]:
df1 + df2 #低维度的会先扩充自己的维度，缺少的值就用NaN来代替

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [199]:
df1.add(df2, fill_value=0) # 意思就是缺省值用0来代替

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [200]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [201]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

#### DataFrame 和 Series 之间的运算

In [ ]:
arr - arr[0]
# 矩阵减去矩阵的第一行，多维数组减去单向量
# 当我们从 arr 减去 arr[0]，每一行都会执行这个操作。
# 这就叫做广播 (broadcasting)

In [202]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [203]:
series = frame.iloc[0]

In [204]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [205]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [206]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [207]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [208]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [209]:
series3 = frame['d']

In [210]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [211]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [212]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### 函数应用和映射

In [213]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [214]:
frame

               b         d         e
Utah   -1.194891 -1.052122  0.693217
Ohio    1.214611 -0.706666  1.445458
Texas   0.794285 -1.099044  1.968075
Oregon -0.737519  0.447139  0.750409

In [215]:
np.abs(frame)

               b         d         e
Utah    1.194891  1.052122  0.693217
Ohio    1.214611  0.706666  1.445458
Texas   0.794285  1.099044  1.968075
Oregon  0.737519  0.447139  0.750409

In [216]:
f = lambda x: x.max() - x.min() # 通过写一个函数来应用到frame上

In [217]:
frame.apply(f) # 上面的x相当于说代表着各个列向量

b    2.409501
d    1.546183
e    1.274857
dtype: float64

In [218]:
frame.apply(f, axis='columns') # 函数映射对列向量上的应用

Utah      1.888108
Ohio      2.152124
Texas     3.067118
Oregon    1.487928
dtype: float64

In [219]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [220]:
frame.apply(f) # 这是对列上的应用

            b         d         e
min -1.194891 -1.099044  0.693217
max  1.214611  0.447139  1.968075

In [221]:
format = lambda x: '%.2f' % x

In [222]:
frame.applymap(format) # 也就是多frame中的元素都是用这个format函数方法

            b      d     e
Utah    -1.19  -1.05  0.69
Ohio     1.21  -0.71  1.45
Texas    0.79  -1.10  1.97
Oregon  -0.74   0.45  0.75

#### 排序和排名

In [225]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [226]:
obj.sort_index() #列排序 
# 通过对axis的选择可以对行或者列进行排序
# 设置ascending=True 升序，反之，降序
# sort_values 按照值的大小来排序
# 缺省值直接排到末尾

a    1
b    2
c    3
d    0
dtype: int64

In [227]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0,
1]})

In [228]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [229]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [231]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

#### 带有重复标签的轴索引

In [232]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [233]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [234]:
obj.index.is_unique #测试 index

False

In [235]:
obj['a']

a    0
a    1
dtype: int64

### 汇总和计算描述统计

In [236]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [237]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [238]:
df.sum() # 设置axis会对行或者列进行求和

one    9.25
two   -5.80
dtype: float64

In [239]:
df.mean(axis='columns', skipna=False)
# NA 值会自动被排除，除非整个切片(这里指的是行或列)都是 NA。
# 通过 skipna 选项可以禁用该功能

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [240]:
df.idxmax()

one    b
two    d
dtype: object

In [241]:
df.cumsum() # 像斐波那契数列一样

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [242]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [243]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [244]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### 相关系数与协方差

In [ ]:
# pandas-datareader

In [ ]:
# daixu... disconnect

#### 唯一值、值计数以及成员资格

In [246]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c',
'c'])

In [247]:
uniques = obj.unique() # 得到不重复的值

In [248]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [249]:
obj.value_counts() #这个方法可以按照出现的次数进行排序

a    3
c    3
b    2
d    1
dtype: int64

In [250]:
pd.value_counts(obj.values, sort=False)

b    2
c    3
a    3
d    1
dtype: int64

In [251]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [252]:
mask = obj.isin(['b', 'c'])
mask
# 判断索引对应的值在不在b c中

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [253]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [254]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [255]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [256]:
pd.Index(unique_vals).get_indexer(to_match)
# 就是将to_match中的值对应上unique_vals上的序号

array([0, 2, 1, 1, 0, 2])